<!-- add-pr-comment:add-pr-comment -->

data.archive_file.func1: Reading...
data.archive_file.func1: Read complete after 0s [id=26e9ba93578c79b902b272b38b7e0a4dc2c252e9]
data.aws_acm_certificate.namabanana: Reading...
data.aws_acm_certificate.namabanana: Read complete after 1s [id=arn:aws:acm:us-east-1:958933161565:certificate/a435f1f9-6cf8-410c-be31-3eb3ee4180a9]
aws_cloudwatch_log_group.func1: Refreshing state... [id=/aws/lambda/send-mail-ses]
aws_api_gateway_rest_api.send_mail_api: Refreshing state... [id=22fm1a0bc1]
data.aws_iam_role.func1_role: Reading...
aws_cloudfront_function.index_document_function: Refreshing state... [id=index-document-function]
aws_s3_bucket.send_mail_ses_src: Refreshing state... [id=send-mail-ses-src]
aws_s3_bucket.static_pages: Refreshing state... [id=note-app-static-pages]
data.aws_iam_role.func1_role: Read complete after 0s [id=LambdaSESMailRole]
aws_api_gateway_resource.send_mail_api_resource: Refreshing state... [id=25xmpf]
aws_api_gateway_method.send_mail_api_post: Refreshing state... [id=agm-22fm1a0bc1-25xmpf-POST]
aws_api_gateway_method_response.post_response: Refreshing state... [id=agmr-22fm1a0bc1-25xmpf-POST-200]
aws_cloudfront_origin_access_control.note_app_oac: Refreshing state... [id=EP34N1TT7FO74]
aws_s3_object.func1: Refreshing state... [id=send-mail-ses.zip]
aws_cloudfront_distribution.note_app_cfront: Refreshing state... [id=E35CO338AZ8MF7]
data.aws_iam_policy_document.policy_document: Reading...
data.aws_iam_policy_document.policy_document: Read complete after 0s [id=3292064385]
aws_s3_bucket_policy.static_website: Refreshing state... [id=note-app-static-pages]
aws_lambda_function.func1: Refreshing state... [id=send-mail-ses]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.send_mail_api_post: Refreshing state... [id=agi-22fm1a0bc1-25xmpf-POST]
aws_api_gateway_integration_response.post_response: Refreshing state... [id=agir-22fm1a0bc1-25xmpf-POST-200]
aws_api_gateway_deployment.send_mail_api: Refreshing state... [id=k8zg82]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_integration.options_integration will be created
  + resource "aws_api_gateway_integration" "options_integration" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = "25xmpf"
      + rest_api_id          = "22fm1a0bc1"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # aws_api_gateway_integration_response.options_response will be created
  + resource "aws_api_gateway_integration_response" "options_response" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "25xmpf"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://www.namabanana.com'"
        }
      + rest_api_id         = "22fm1a0bc1"
      + status_code         = "200"
    }

  # aws_api_gateway_method.options_method will be created
  + resource "aws_api_gateway_method" "options_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = "25xmpf"
      + rest_api_id      = "22fm1a0bc1"
    }

  # aws_api_gateway_method_response.options_response will be created
  + resource "aws_api_gateway_method_response" "options_response" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "25xmpf"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "22fm1a0bc1"
      + status_code         = "200"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on apigateway.tf line 43, in resource "aws_api_gateway_deployment" "send_mail_api":
  43:     "aws_api_gateway_integration.send_mail_api_post",

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

Warning: Argument is deprecated

  with aws_api_gateway_deployment.send_mail_api,
  on apigateway.tf line 47, in resource "aws_api_gateway_deployment" "send_mail_api":
  47:   stage_name  = "v1"

stage_name is deprecated. Use the aws_api_gateway_stage resource instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
